<a href="https://colab.research.google.com/github/Satyamaadi/python/blob/master/Handling_dates_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##Converting string to dates

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [7]:
date_string = ['02-08-2021 6:00 PM','01-05-2021 7:00 AM','04-05-2021 12:00 PM']

In [8]:
[pd.to_datetime(date,format='%d-%m-%Y %I:%M %p') for date in date_string]

[Timestamp('2021-08-02 18:00:00'),
 Timestamp('2021-05-01 07:00:00'),
 Timestamp('2021-05-04 12:00:00')]

In [11]:
#Adding time-zones
pd.Timestamp('02-08-2021 06:05:00',tz='Asia/Kolkata')

Timestamp('2021-02-08 06:05:00+0530', tz='Asia/Kolkata')

In [12]:
#Selecting dates

In [13]:
df = pd.DataFrame()

In [14]:
df['date'] = pd.date_range('1/1/2005',periods=1000,freq='H')

In [20]:
df[df['date'] > '2005-01-01 03:00:00']

                   date
4   2005-01-01 04:00:00
5   2005-01-01 05:00:00
6   2005-01-01 06:00:00
7   2005-01-01 07:00:00
8   2005-01-01 08:00:00
..                  ...
995 2005-02-11 11:00:00
996 2005-02-11 12:00:00
997 2005-02-11 13:00:00
998 2005-02-11 14:00:00
999 2005-02-11 15:00:00

[996 rows x 1 columns]

##Perform selection by indexing date itself

In [21]:
df.set_index(df['date'])

                                   date
date
2005-01-01 00:00:00 2005-01-01 00:00:00
2005-01-01 01:00:00 2005-01-01 01:00:00
2005-01-01 02:00:00 2005-01-01 02:00:00
2005-01-01 03:00:00 2005-01-01 03:00:00
2005-01-01 04:00:00 2005-01-01 04:00:00
...                                 ...
2005-02-11 11:00:00 2005-02-11 11:00:00
2005-02-11 12:00:00 2005-02-11 12:00:00
2005-02-11 13:00:00 2005-02-11 13:00:00
2005-02-11 14:00:00 2005-02-11 14:00:00
2005-02-11 15:00:00 2005-02-11 15:00:00

[1000 rows x 1 columns]

In [23]:
df.loc['2005-04-04':]

                   date
201 2005-01-09 09:00:00
202 2005-01-09 10:00:00
203 2005-01-09 11:00:00
204 2005-01-09 12:00:00
205 2005-01-09 13:00:00
..                  ...
995 2005-02-11 11:00:00
996 2005-02-11 12:00:00
997 2005-02-11 13:00:00
998 2005-02-11 14:00:00
999 2005-02-11 15:00:00

[799 rows x 1 columns]

##Breaking date into multiple features

In [24]:
df['year'] = df['date'].dt.year

In [25]:
df['year'] ##similarly use dt.day dt.month dt.hour dt.minute to extract

0      2005
1      2005
2      2005
3      2005
4      2005
       ...
995    2005
996    2005
997    2005
998    2005
999    2005
Name: year, Length: 1000, dtype: int64

##Calculating difference between dates

In [26]:
df = pd.DataFrame()

In [27]:
df['arrived'] = [pd.Timestamp('04-05-2019'),pd.Timestamp('05-05-2019')]

In [28]:
df['left'] = [pd.Timestamp('06-05-2019'),pd.Timestamp('08-05-2019')] #remember date format is mm-dd-yyyy

In [29]:
df['left'] - df['arrived']

0   61 days
1   92 days
dtype: timedelta64[ns]

##Handling days

In [37]:
df = pd.Series(pd.date_range('12-19-1999',periods=4,freq='M'))

In [38]:
df

0   1999-12-31
1   2000-01-31
2   2000-02-29
3   2000-03-31
dtype: datetime64[ns]

In [42]:
df.dt.dayofweek

0    4
1    0
2    1
3    4
dtype: int64